---
kind: enumMember
id: F:Autodesk.Revit.DB.CurveElementType.CurveByPoints
enum: Autodesk.Revit.DB.CurveElementType
source: html/bb7da2a1-6a68-df2a-aacb-1d90c8a0f5b7.htm
---
# Autodesk.Revit.DB.CurveElementType.CurveByPoints

A curve created by connecting a set of points.